# Aggregation and Grouping

In [2]:
# We can do efficient summarization, such as computing aggregations (sum(), mean(), median() etc)
# in which a single number gives insight into the nature of a large dataset.

In [3]:
 # Planets Data

 '''Let’s use the Planets dataset, which is available on Seaborn Package. It gives information on
 planets that astronomers have discovered around other stars. '''

'Let’s use the Planets dataset, which is available on Seaborn Package. It gives information on\nplanets that astronomers have discovered around other stars. '

In [4]:
import seaborn as sb
planets = sb.load_dataset('planets')
planets.shape

(1035, 6)

In [5]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [6]:
# Simple Aggregation in Pandas

 # Just like in NumPy arrays, in Pandas Series the aggregates return a single value.

In [7]:
import numpy as np
import pandas as pd
rng = np.random.RandomState(42)

 # Series
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [8]:
ser.sum()

np.float64(2.811925491708157)

In [9]:
ser.mean()

np.float64(0.5623850983416314)

In [10]:
# DataFrame
df = pd.DataFrame({'A': rng.rand(5),
                    'B': rng.rand(5)})
df

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [11]:
df.mean() # returns means by columns by default

A    0.477888
B    0.443420
dtype: float64

In [12]:
# mean by rows
df.mean(axis=1)

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [13]:
#alternatively
df.mean(axis='columns')

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [14]:
planets.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [15]:
planets.dropna().describe() # drop the NA's and compute the aggregates

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [16]:
planets

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [35]:
# GroupBy: Split, Apply, Combine

'''As seen in the above figure,
 • Thesplit step breaks up and groups a DataFrame depending on the value of the specified key.
 • The apply step involves computing some function (usually an aggregate, transformation, or
 f
 iltering) within the individual groups.
 • The combine step merges the results of these individual operations into an output array.
 Let’s look at an example.
 '''

'As seen in the above figure,\n • Thesplit step breaks up and groups a DataFrame depending on the value of the specified key.\n • The apply step involves computing some function (usually an aggregate, transformation, or\n f\n iltering) within the individual groups.\n • The combine step merges the results of these individual operations into an output array.\n Let’s look at an example.\n '